{
  "_name_or_path": "google-bert/bert-base-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.05,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.05,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CVE",
    "1": "B-Event",
    "2": "B-LOC",
    "3": "B-MAL-ORG",
    "4": "B-MISC",
    "5": "B-Malware",
    "6": "B-ORG",
    "7": "B-PER",
    "8": "B-Software",
    "9": "I-CVE",
    "10": "I-Event",
    "11": "I-LOC",
    "12": "I-MAL-ORG",
    "13": "I-MISC",
    "14": "I-Malware",
    "15": "I-ORG",
    "16": "I-PER",
    "17": "I-Software",
    "18": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CVE": 0,
    "B-Event": 1,
    "B-LOC": 2,
    "B-MAL-ORG": 3,
    "B-MISC": 4,
    "B-Malware": 5,
    "B-ORG": 6,
    "B-PER": 7,
    "B-Software": 8,
    "I-CVE": 9,
    "I-Event": 10,
    "I-LOC": 11,
    "I-MAL-ORG": 12,
    "I-MISC": 13,
    "I-Malware": 14,
    "I-ORG": 15,
    "I-PER": 16,
    "I-Software": 17,
    "O": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
