{
  "_name_or_path": "answerdotai/ModernBERT-base",
  "architectures": [
    "ModernBertForTokenClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "B-CVE",
    "1": "B-Event",
    "2": "B-LOC",
    "3": "B-MAL-ORG",
    "4": "B-MISC",
    "5": "B-Malware",
    "6": "B-ORG",
    "7": "B-PER",
    "8": "B-Software",
    "9": "I-CVE",
    "10": "I-Event",
    "11": "I-LOC",
    "12": "I-MAL-ORG",
    "13": "I-MISC",
    "14": "I-Malware",
    "15": "I-ORG",
    "16": "I-PER",
    "17": "I-Software",
    "18": "O"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "B-CVE": 0,
    "B-Event": 1,
    "B-LOC": 2,
    "B-MAL-ORG": 3,
    "B-MISC": 4,
    "B-Malware": 5,
    "B-ORG": 6,
    "B-PER": 7,
    "B-Software": 8,
    "I-CVE": 9,
    "I-Event": 10,
    "I-LOC": 11,
    "I-MAL-ORG": 12,
    "I-MISC": 13,
    "I-Malware": 14,
    "I-ORG": 15,
    "I-PER": 16,
    "I-Software": 17,
    "O": 18
  },
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "reference_compile": false,
  "repad_logits_with_grad": false,
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "vocab_size": 50368
}
